//Сертификат SoloLearn: https://www.sololearn.com/Certificate/1024-1364437/pdf/

1. Основные понятия
	1.1 Переменные
		Это контейнеры для хранения значений. Значение может меняться в течение работы программы
			var x = 10;

		Правила именования:
		- Первым символом должна быть буква, "_" или "$". 
		- Имена н могу содержать математически или логические операторы. Например: 2*blabla.
		- Имена не могу содержать пробелы.
		- Дефисы зарезервинованы для вычитания.
		- Нельзя использовать зарезерванные слова и специальые символы. https://api.sololearn.com/DownloadFile?id=2741

	1.2 Типы данных
		String, Number, Boolean, Arrays, Objects.
		Для тог, что  бы в поместить в строку символ необходимо ставить "\" перед ним. Например: "\"". "\n" - новая строка.

	1.3 Математические операторы
		Все обычные и 
		% - деление по модулю (остаок по модулю).
		++ - инкримент (+1).
		-- - декримент (-1).

	1.4 Операторы присванивания
		https://api.sololearn.com/DownloadFile?id=2747

	1.5 Операторы сравнения
		https://api.sololearn.com/DownloadFile?id=2748
		Возвращают true or false 

	1.6 Логические и Булевые операторы
		AND, OR and NOT https://api.sololearn.com/DownloadFile?id=2749
		&& - оператор "И".

		Условный (тернарный) оператор - "?". 
		variable = (condition) ? value1: value2 
		Например:
		var isAdult = (age < 18) ? "Too young": "Old enough";

	1.7 Строковые операторы
		Конкатенация - соедниенеие множества строк по средствам "+".
